src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникКонтактныеЛица</name>
      <description>Контактная информация справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникЛичныеАдресаты</name>
      <description>Контактная информация справочника &quot;Личные адресаты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРолиИсполнителей</name>
      <description>Контактная информация справочника &quot;Роли исполнителей&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
    <items>
      <name>УдалитьДругаяИнформацияОрганизации</name>
      <description>Другое</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НаборыДополнительныхРеквизитовИСведений/НаборыДополнительныхРеквизитовИСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыДополнительныхРеквизитовИСведений</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БизнесПроцесс_КомплексныйПроцесс</name>
      <description>Доп. свойства комплексного процесса</description>
    </items>
    <items>
      <name>БизнесПроцесс_Исполнение</name>
      <description>Доп. свойства процесса &quot;Исполнение&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Ознакомление</name>
      <description>Доп. свойства процесса &quot;Ознакомление&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Поручение</name>
      <description>Доп. свойства процесса &quot;Поручение&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Приглашение</name>
      <description>Доп. свойства процесса &quot;Приглашение&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Рассмотрение</name>
      <description>Доп. свойства процесса &quot;Рассмотрение&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Регистрация</name>
      <description>Доп. свойства процесса &quot;Регистрация&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_РешениеВопросовВыполненияЗадач</name>
      <description>Доп. свойства процесса &quot;Решение вопросов выполнения задач&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Согласование</name>
      <description>Доп. свойства процесса &quot;Согласование&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_Утверждение</name>
      <description>Доп. свойства процесса &quot;Утверждение&quot;</description>
    </items>
    <items>
      <name>Справочник_БанковскиеСчета</name>
      <description>Доп. свойства справочника &quot;Банковские счета&quot;</description>
    </items>
    <items>
      <name>Справочник_ВнутренниеДокументы</name>
      <description>Доп. свойства справочника &quot;Внутренние документы&quot;</description>
    </items>
    <items>
      <name>Справочник_ВходящиеДокументы</name>
      <description>Доп. свойства справочника &quot;Входящие документы&quot;</description>
    </items>
    <items>
      <name>Справочник_ИсходящиеДокументы</name>
      <description>Доп. свойства справочника &quot;Исходящие документы&quot;</description>
    </items>
    <items>
      <name>Справочник_Контрагенты</name>
      <description>Доп. свойства справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>Справочник_Мероприятия</name>
      <description>Доп. свойства справочника &quot;Мероприятия&quot;</description>
    </items>
    <items>
      <name>Справочник_ПроектныеЗадачи</name>
      <description>Доп. свойства справочника &quot;Проектные задачи&quot;</description>
    </items>
    <items>
      <name>Справочник_Проекты</name>
      <description>Доп. свойства справочника &quot;Проекты&quot;</description>
    </items>
    <items>
      <name>Удалить_Справочник_Мероприятия</name>
      <description>(Удалить) Доп. свойства справочника &quot;Мероприятия&quot;</description>
    </items>
    <items>
      <name>Документ_ЕжедневныйОтчет</name>
      <description>Доп. свойства документа &quot;Ежедневный отчет&quot;</description>
    </items>
    <items>
      <name>Задача_ЗадачаИсполнителя</name>
      <description>Доп. свойства задач (Общие)</description>
    </items>
    <items>
      <name>БизнесПроцесс_ОбработкаВнутреннегоДокумента</name>
      <description>Доп. свойства процесса &quot;Обработка внутреннего документа&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_ОбработкаВходящегоДокумента</name>
      <description>Доп. свойства процесса &quot;Обработка входящего документа&quot;</description>
    </items>
    <items>
      <name>БизнесПроцесс_ОбработкаИсходящегоДокумента</name>
      <description>Доп. свойства процесса &quot;Обработка исходящего документа&quot;</description>
    </items>
    <items>
      <name>Справочник_ВидыРабот</name>
      <description>Доп. свойства справочника &quot;Виды работ&quot;</description>
    </items>
    <items>
      <name>УдалитьСправочник_ВнешниеПользователи</name>
      <description>Доп. свойства справочника &quot;Внешние пользователи&quot;</description>
    </items>
    <items>
      <name>Справочник_Должности</name>
      <description>Доп. свойства справочника &quot;Должности&quot;</description>
    </items>
    <items>
      <name>Справочник_КонтактныеЛица</name>
      <description>Доп. свойства справочника &quot;Контактные лица&quot;</description>
    </items>
    <items>
      <name>Справочник_Контроль</name>
      <description>Доп. свойства справочника &quot;Контроль&quot;</description>
    </items>
    <items>
      <name>Справочник_Организации</name>
      <description>Доп. свойства справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>Справочник_ПапкиФайлов</name>
      <description>Доп. свойства справочника &quot;Папки файлов&quot;</description>
    </items>
    <items>
      <name>УдалитьСправочник_Пользователи</name>
      <description>Доп. свойства справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>Справочник_СтруктураПредприятия</name>
      <description>Доп. свойства справочника &quot;Структура предприятия&quot;</description>
    </items>
    <items>
      <name>Справочник_Номенклатура</name>
      <description>Доп. свойства справочника &quot;Товары и услуги&quot;</description>
    </items>
    <items>
      <name>Справочник_Файлы</name>
      <description>Доп. свойства справочника &quot;Файлы&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСведений</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоНабора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСведения</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаУдаления</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПредопределенногоНабора</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НаименованияСторон/НаименованияСторон.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаименованияСторон</name>
  <predefined>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Исполнитель</name>
      <description>Исполнитель</description>
    </items>
    <items>
      <name>Плательщик</name>
      <description>Плательщик</description>
    </items>
    <items>
      <name>Покупатель</name>
      <description>Покупатель</description>
    </items>
    <items>
      <name>Получатель</name>
      <description>Получатель</description>
    </items>
    <items>
      <name>Продавец</name>
      <description>Продавец</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/Catalogs/ИсточникиДанных/ИсточникиДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиДанных</name>
  <predefined>
    <items>
      <name>ЗагрузкаИз1САрхив</name>
      <description>Загрузка из &quot;1С:Архив&quot;</description>
    </items>
    <items>
      <name>СВД</name>
      <description>СВД</description>
    </items>
    <items>
      <name>УстановкаТиповойМетодики</name>
      <description>Установка типовой методики</description>
    </items>
    <items>
      <name>ЭДО</name>
      <description>ЭДО</description>
    </items>
  </predefined>
</mdclass:Catalog>

src/CommonModules/ЛокализацияКонфигурацииПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается при первом запуске. Служит для первоначального наполнения информационной базы.
//
Процедура ПервыйЗапуск() Экспорт
	
	
	
КонецПроцедуры

// Добавляет в список процедуры-обработчики перехода с другой программы (с другим именем конфигурации).
// Например, для перехода между разными, но родственными конфигурациями: базовая -> проф -> корп.
// Вызывается перед началом обновления данных ИБ.
//
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * ПредыдущееИмяКонфигурации - Строка - имя конфигурации, с которой выполняется переход;
//    * Процедура                 - Строка - полное имя процедуры-обработчика перехода с программы ПредыдущееИмяКонфигурации. 
//                                  Например, "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику"
//                                  Обязательно должна быть экспортной.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.ПредыдущееИмяКонфигурации  = "УправлениеТорговлей";
//  Обработчик.Процедура                  = "ОбновлениеИнформационнойБазыУПП.ЗаполнитьУчетнуюПолитику";
//
Процедура ПриДобавленииОбработчиковПереходаСДругойПрограммы(Обработчики) Экспорт
	
	
	
КонецПроцедуры

// Вызвается при определении представления типа для указанного пользователя.
//
// Параметры:
//   Тип - Тип - тип, представление которого следует определить.
//   Пользователь - СправочникСсылка.Пользователи - пользователь, которому нужно представление.
//   Представление - Строка - локализованное для пользователя представление, или
//                 - Неопределено - признак стандартной обработки.
//
Процедура ПриОпределенииПредставленияТипаДляПользователя(Тип, Пользователь, Представление) Экспорт
	
	
	
КонецПроцедуры

// Вызвается при определении кода языка исполнителя задачи. Позволяет переопределить стандартное
// поведение.
//
// Параметры:
//   Задача - ЗадачаОбъект.ЗадачаИсполнителя - задача, для которой определяется код языка.
//   КодЯзыка - Строка - переопределенный код языка, или
//            - Неопределено - признак необходимости выполнить стандартное определение.
//
Процедура ПриОпределенииКодаЯзыкаИсполнителяЗадачи(Задача, КодЯзыка) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при обновлении на 2.1.1.1 и дает локализованные наименования справочнику "Уровни доступа".
//
Процедура ПерейтиНаВерсию_2_1_1_1() Экспорт
	
	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Регистрация,
		"Наименование",
		НСтр("ru = 'Регистрация'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Редактирование,
		"Наименование",
		НСтр("ru = 'Редактирование'"));

	ОбновитьПредопределенныйЭлемент(Справочники.УровниДоступа.Чтение,
		"Наименование",
		НСтр("ru = 'Чтение'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.6.1 и корректирует перевод термина "Организация".
//
Процедура ПерейтиНаВерсию_2_1_6_1() Экспорт
	
	Справочники.АдреснаяКнига.ОбновитьСпискиАвтоподстановок();
	
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ОбъектыАдресацииЗадач.Организация,
		"Наименование",
		НСтр("ru = 'Организация'"));
		
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Организации,
		"Наименование",
		НСтр("ru = 'Организации'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ВидыКонтактнойИнформации.СправочникОрганизации,
		"Наименование",
		НСтр("ru = 'Контактная информация справочника ""Организации""'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_БанковскиеСчетаОрганизации,
		"Наименование",
		НСтр("ru = 'Доп. свойства справочника ""Банковские счета"" (организации)'"));
		
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.СодержитСсылкуНаИнтегрированныйОбъект,
		"Наименование",
		НСтр("ru = 'Содержит ссылку на'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправлениеПисьма,
		"Наименование",
		НСтр("ru = 'Перенаправление письма'"));

	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПеренаправленоПисьмом,
		"Наименование",
		НСтр("ru = 'Перенаправлено письмом'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.7.9 и дает локализованные наименования новым предопределенным элементам данных.
//
Процедура ПерейтиНаВерсию_2_1_7_9() Экспорт
	
	ОбновитьПредопределенныйЭлемент(ПланыВидовХарактеристик.ВидыДоступа.Подразделения,
		"Наименование",
		НСтр("ru = 'Подразделения'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.8.11 и дает локализованные наименования новым предопределенным элементам данных.
//
Процедура ПерейтиНаВерсию_2_1_8_11() Экспорт
	
	// Справочники.НаименованияСторон.

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Заказчик,
		"Наименование",
		НСтр("ru = 'Заказчик'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Исполнитель,
		"Наименование",
		НСтр("ru = 'Исполнитель'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Покупатель,
		"Наименование",
		НСтр("ru = 'Покупатель'"));

	ОбновитьПредопределенныйЭлемент(Справочники.НаименованияСторон.Продавец,
		"Наименование",
		НСтр("ru = 'Продавец'"));

КонецПроцедуры

// Вызывается при обновлении на 2.1.13.23 и дает локализованные наименования новым предопределенным элементам данных.
//
Процедура ПерейтиНаВерсию_2_1_13_24() Экспорт
	
	ОбновитьПредопределенныйЭлемент(Справочники.ВидыБизнесСобытий.ИзменениеСостоянияДокументаПоЭДО,
		"Наименование",
		НСтр("ru = 'Изменение состояния документа по ЭДО'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ИсточникиДанных.ЭДО,
		"Наименование",
		НСтр("ru = 'ЭДО'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ИсточникиДанных.УстановкаТиповойМетодики,
		"Наименование",
		НСтр("ru = 'Установка типовой методики'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ИсточникиДанных.СВД,
		"Наименование",
		НСтр("ru = 'СВД'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ИсточникиДанных.ЗагрузкаИз1САрхив,
		"Наименование",
		НСтр("ru = 'Загрузка из ""1С:Архив""'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.КатегорииОтчетов.ЭДО,
		"Наименование",
		НСтр("ru = 'ЭДО'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПереадресованДокументомПоВопросу,
		"Наименование",
		НСтр("ru = 'Переадресован документом по вопросу'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ПереадресацияДокументаПоВопросу,
		"Наименование",
		НСтр("ru = 'Переадресация документа по вопросу'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.КорректировкаК,
		"Наименование",
		НСтр("ru = 'Корректировка к'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.ИсправлениеК,
		"Наименование",
		НСтр("ru = 'Исправление к'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.Корректировка,
		"Наименование",
		НСтр("ru = 'Корректировка'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ТипыСвязей.Исправление,
		"Наименование",
		НСтр("ru = 'Исправление'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныИсполнения.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныКомплексныхБизнесПроцессов.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныОзнакомления.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныПриглашения.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныРассмотрения.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныРегистрации.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныСогласования.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныСоставныхБизнесПроцессов.ОбработкаВходящегоДокументаПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныСоставныхБизнесПроцессов.ОбработкаИсходящегоДокументаПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныСоставныхБизнесПроцессов.ОбработкаВнутреннегоДокументаПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
	ОбновитьПредопределенныйЭлемент(Справочники.ШаблоныСогласования.ПоУмолчанию,
		"Наименование",
		НСтр("ru = 'По умолчанию'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обновляет реквизиты предопределенного элемента (необходимо для локализации).
//
Процедура ОбновитьПредопределенныйЭлемент(ПредопределенныйЭлемент, 
	ИмяРеквизита1 = Неопределено, ЗначениеРеквизита1 = Неопределено,
	ИмяРеквизита2 = Неопределено, ЗначениеРеквизита2 = Неопределено,
	ИмяРеквизита3 = Неопределено, ЗначениеРеквизита3 = Неопределено)
	
	Элемент = ПредопределенныйЭлемент.ПолучитьОбъект();
	
	НужнаЗапись = Ложь;
	
	Если ИмяРеквизита1 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита1) Тогда
		Если Элемент[ИмяРеквизита1] <> ЗначениеРеквизита1 Тогда
			Элемент[ИмяРеквизита1] = ЗначениеРеквизита1;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРеквизита2 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита2)  Тогда
		Если Элемент[ИмяРеквизита2] <> ЗначениеРеквизита2 Тогда
			Элемент[ИмяРеквизита2] = ЗначениеРеквизита2;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяРеквизита3 <> Неопределено
		И ЗначениеЗаполнено(ЗначениеРеквизита3) Тогда
		Если Элемент[ИмяРеквизита3] <> ЗначениеРеквизита3 Тогда
			Элемент[ИмяРеквизита3] = ЗначениеРеквизита3;
			НужнаЗапись = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаЗапись Тогда
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Элемент);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
